# 1. Replace the department name "HR" with "Human Resources"

In [47]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Amit', 'Bhavna', 'Chirag', 'Deepa', 'Eshan', 'Farah'],
    'Department': ['HR', 'Finance', 'IT', 'HR', 'Finance', 'IT'],
    'Experience': [3, 7, 5, 2, 10, 4],
    'Salary': [45000, 70000, 60000, 40000, 85000, 55000]
}

df=pd.DataFrame(data)
df

     Name Department  Experience  Salary
0    Amit         HR           3   45000
1  Bhavna    Finance           7   70000
2  Chirag         IT           5   60000
3   Deepa         HR           2   40000
4   Eshan    Finance          10   85000
5   Farah         IT           4   55000

In [49]:
df['Department']=df['Department'].str.replace('HR','Human Resources')
df

     Name       Department  Experience  Salary
0    Amit  Human Resources           3   45000
1  Bhavna          Finance           7   70000
2  Chirag               IT           5   60000
3   Deepa  Human Resources           2   40000
4   Eshan          Finance          10   85000
5   Farah               IT           4   55000

# 2. Show the name(s) of the highest paid employee(s)

In [66]:
df[df['Salary']==df['Salary'].max()][['Name','Salary']]

    Name  Salary
4  Eshan   85000

# 3. Count how many employees are in each department.

In [93]:
df.groupby(by="Department").size().reset_index(name='count of employees')

        Department  count of employees
0          Finance                   2
1  Human Resources                   2
2               IT                   2

# 4. Create a new column Seniority using experience:
 #### 'Junior' if Experience < 5
 #### 'Mid-level' if Experience is between 5 and 8
 #### 'Senior' if Experience > 8

In [116]:
df["Senioruty"]=np.where(df['Experience']<5,'junior',np.where((df['Experience']>=5) & (df['Experience']<=8),'Mid-level','Senior'))

In [118]:
df

     Name       Department  Experience  Salary  Senioruty
0    Amit  Human Resources           3   45000     junior
1  Bhavna          Finance           7   70000  Mid-level
2  Chirag               IT           5   60000  Mid-level
3   Deepa  Human Resources           2   40000     junior
4   Eshan          Finance          10   85000     Senior
5   Farah               IT           4   55000     junior

# 5. Find the average salary of only those in the 'IT' department with more than 3 years of experience.

In [183]:
df[ (df['Experience']>3) & (df['Department']=="IT") ]['Salary'].mean()

57500.0